# SetupEnergySimulationDialog Constructor (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
SetupEnergySimulationDialog Constructor
SetupEnergySimulationDialog Class See Also
---
Constructs a new instance of the SetupEnergySimulationDialog class.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2016
# Syntax
C#
---
```text
public SetupEnergySimulationDialog()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
SetupEnergySimulationDialog()
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | The user has not signed in to their Autodesk account. |

# See Also
SetupEnergySimulationDialog Class
Autodesk.Revit.UI Namespace